Revit 2024 API
AnalysisDisplayMarkersAndTextSettings Constructor
 Constructs a default instance of markers and text settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayMarkersAndTextSettings()
Visual Basic
Public Sub New
Visual C++
public:
AnalysisDisplayMarkersAndTextSettings()
See Also
AnalysisDisplayMarkersAndTextSettings Class
AnalysisDisplayMarkersAndTextSettings Overload
Autodesk.Revit.DB.Analysis Namespace